ARMmbed/DAPLink/source/hic_hal/stm32/drivers/usbd_STM32F4xx_FS.c
/*
 * Copyright (c) 2004-2013,2022 ARM Limited. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

/*----------------------------------------------------------------------------
 *      RL-ARM - USB
 *----------------------------------------------------------------------------
 *      Name:    usbd_STM32F4xx_FS.c
 *      Purpose: Hardware Layer module for ST STM32F407
 *      Rev.:    V4.70
 *----------------------------------------------------------------------------
 *      This code is part of the RealView Run-Time Library.
 *      Copyright (c) 2004-2013 KEIL - An ARM Company. All rights reserved.
 *---------------------------------------------------------------------------*/

#include <RTL.h>
#include <rl_usb.h>
#include <stm32f4xx.h> 

#define __NO_USB_LIB_C
#include "usb_config_FS.c"

#define OTG                 OTG_FS

#define RX_FIFO_SIZE        256
#define TX0_FIFO_SIZE       64
#define TX1_FIFO_SIZE       64
#define TX2_FIFO_SIZE       64
#define TX3_FIFO_SIZE       64

#define TX_FIFO(n)          *((__packed volatile uint32_t*)(OTG_FS_BASE + 0x1000 + n*0x1000))
#define RX_FIFO             *((volatile uint32_t*)(OTG_FS_BASE + 0x1000))

#define DIEPTSIZ(EPNum)     *(&OTG->DIEPTSIZ0 + EPNum * 8)
#define DIEPCTL(EPNum)      *(&OTG->DIEPCTL0  + EPNum * 8)
#define DTXFSTS(EPNum)      *(&OTG->DTXFSTS0  + EPNum * 8)
#define DOEPTSIZ(EPNum)     *(&OTG->DOEPTSIZ0 + EPNum * 8)
#define DOEPCTL(EPNum)      *(&OTG->DOEPCTL0  + EPNum * 8)
#define DIEPINT(EPNum)      *(&OTG->DIEPINT0  + EPNum * 8)
#define DOEPINT(EPNum)      *(&OTG->DOEPINT0  + EPNum * 8)

#define EP_IN_TYPE(num)      ((DIEPCTL(num) >> 18) & 3)
#define EP_OUT_TYPE(num)     ((DOEPCTL(num) >> 18) & 3)

uint32_t OutMaxPacketSize[4] = {USBD_MAX_PACKET0,0,0,0};

#if (USBD_HID_ENABLE == 1)
uint32_t HID_IntInPacketData     [(USBD_HID_MAX_PACKET + 3) / 4];
#endif
#if (USBD_CDC_ACM_ENABLE == 1)
uint32_t CDC_ACM_IntInPacketData [(USBD_CDC_ACM_MAX_PACKET  + 3) / 4];
#endif

uint32_t *InPacketDataPtr[4] = { 0,
#if   ((USBD_HID_ENABLE     == 1) && (USBD_HID_EP_INTIN      == 1))
                       HID_IntInPacketData,
#elif ((USBD_CDC_ACM_ENABLE == 1) && (USBD_CDC_ACM_EP_INTIN  == 1))
                       CDC_ACM_IntInPacketData, 
#else
                            0, 
#endif

#if   ((USBD_HID_ENABLE     == 1) && (USBD_HID_EP_INTIN      == 2))
                       HID_IntInPacketData, 
#elif ((USBD_CDC_ACM_ENABLE == 1) && (USBD_CDC_ACM_EP_INTIN  == 2))
                       CDC_ACM_IntInPacketData, 
#else
                            0, 
#endif

#if   ((USBD_HID_ENABLE     == 1) && (USBD_HID_EP_INTIN      == 3))
                       HID_IntInPacketData, 
#elif ((USBD_CDC_ACM_ENABLE == 1) && (USBD_CDC_ACM_EP_INTIN  == 3))
                       CDC_ACM_IntInPacketData, 
#else
                            0, 
#endif
};


#if    (USBD_ADC_ENABLE == 1)

uint32_t ADC_IsoOutPacketData    [(USBD_ADC_WMAXPACKETSIZE + 3) / 4];

uint32_t *IsoOutPacketDataPtr[4] = { 0,
#if    (USBD_ADC_EP_ISOOUT == 1)
                                     ADC_IsoOutPacketData,
#else
                                     0,
#endif
  
#if    (USBD_ADC_EP_ISOOUT == 2)
                                     ADC_IsoOutPacketData,
#else
                                     0,
#endif
  
#if    (USBD_ADC_EP_ISOOUT == 3)
                                     ADC_IsoOutPacketData,
#else
                                     0,
#endif
};
#else
uint32_t *IsoOutPacketDataPtr[4] = { 0 };
#endif


uint32_t InPacketDataCnt[4]      = { 0 };
uint32_t InPacketDataReady       =   0  ;
uint32_t SyncWriteEP             =   0  ;

uint32_t IsoOutPacketDataCnt[4]  = { 0 };
uint32_t IsoOutTokenRead         =   0  ;

/*
 *  usbd_stm32_delay
 *    Parameters:      delay:      Delay in 100 us ticks
 *    Return Value:    None
 */
void usbd_stm32_delay (uint32_t delay) {
  delay *= SystemCoreClock / 100000;
  while (delay--) {
    __nop(); __nop(); __nop(); __nop(); __nop(); __nop(); __nop(); __nop();
  }
}


/*
 *  USB Device Interrupt enable
 *   Called by USBD_Init to enable the USB Interrupt
 *    Return Value:    None
 */

#ifdef __RTX
void __svc(1) USBD_IntrEna (void);
void __SVC_1               (void) {
#else
void          USBD_IntrEna (void) {
#endif
  NVIC_EnableIRQ   (OTG_FS_IRQn);       /* Enable OTG interrupt               */
}


/*
 *  USB Device Initialize Function
 *   Called by the User to initialize USB
 *   Return Value:    None
 */

void USBD_Init (void) {
  int32_t tout;

  /* Configure  PA10, PA11, PA12 as alternate OTG_FS                          */
  RCC->AHB1ENR    |=   1;

  GPIOA->MODER     =  (GPIOA->MODER  & ~(3 << 20)) | (2  << 20);
  GPIOA->OTYPER   &= ~(1 << 10);
  GPIOA->AFR[1]    =  (GPIOA->AFR[1] & ~(15 << 8)) | (10 <<  8);
  GPIOA->OSPEEDR  |=  (3 << 20);
  GPIOA->PUPDR    &= ~(3 << 20);

  GPIOA->MODER     =  (GPIOA->MODER  & ~(3  << 22)) | (2  << 22);
  GPIOA->OTYPER   &= ~(1 << 11);
  GPIOA->AFR[1]    =  (GPIOA->AFR[1] & ~(15 << 12)) | (10 << 12);
  GPIOA->OSPEEDR  |=  (3 << 22);
  GPIOA->PUPDR    &= ~(3 << 22);

  GPIOA->MODER     =  (GPIOA->MODER  & ~(3  << 24)) | (2  << 24);
  GPIOA->OTYPER   &= ~(1 << 12);
  GPIOA->AFR[1]    =  (GPIOA->AFR[1] & ~(15 << 16)) | (10 << 16);
  GPIOA->OSPEEDR  |=  (3 << 24);
  GPIOA->PUPDR    &= ~(3 << 24);

  RCC->AHB2ENR    |=  (1 <<  7);        /* Enable clock for OTG FS            */
  usbd_stm32_delay    (100);            /* Wait ~10 ms                        */
  RCC->AHB2RSTR   |=  (1 <<  7);        /* Reset OTG FS clock                 */
  usbd_stm32_delay    (100);            /* Wait ~10 ms                        */
  RCC->AHB2RSTR   &= ~(1 <<  7);
  usbd_stm32_delay    (400);            /* Wait ~40 ms                        */

