ARMmbed/DAPLink/source/hic_hal/stm32/drivers/usbd_STM32F4xx_FS.c
  OTG->GUSBCFG    |=  (1 <<  6) ;       /* PHYSEL=1                           */
  usbd_stm32_delay    (200);            /* Wait ~20 ms                        */
  tout = 1000;                          /* Wait max 1 s for AHBIDL = 0        */
  while (!(OTG->GRSTCTL & (1UL << 31))) {
    if (!tout) break;
    tout --;
    usbd_stm32_delay  (10);             /* Wait 1 ms                          */
  }
  OTG->GRSTCTL    |=  1;                /* reset otg core                     */
  tout = 1000;                          /* Wait max 1 s for CRST = 0          */
  while (OTG->GRSTCTL & (1 << 0)) {
    if (!tout) break;
    tout --;
    usbd_stm32_delay  (10);             /* Wait 1 ms                          */
  }
  usbd_stm32_delay    (30);             /* Wait 3 ms                          */

  OTG->GAHBCFG    &=  ~1;               /* Disable interrupts                 */
  OTG->GCCFG      &= ~(1 << 19);        /* No VBUS sensing device "B"         */
  OTG->DCTL       |=  (1 <<  1);        /* soft disconnect enabled            */

  OTG->GUSBCFG     =  (OTG->GUSBCFG & ~(15UL << 10)) | (9 << 10); /*turnaround*/
  OTG->GUSBCFG    |=  (1 << 30);        /* Force device mode                  */
  usbd_stm32_delay    (1000);           /* Wait min 25 ms, we wait ~100 ms    */

  OTG->DCFG       |=  3;                /* Full speed phy                     */

  OTG->GINTMSK     = (1   << 11) |      /* suspend int unmask                 */
                     (1   << 12) |      /* reset int unmask                   */
                     (1   << 13) |      /* enumeration done int unmask        */
                     (1   << 4 ) |      /* receive fifo non-empty int  unmask */
                     (1   << 18) |      /* IN EP int unmask                   */
                     (1   << 19) |      /* OUT EP int unmask                  */
                     (1UL << 31) |      /* resume int unmask                  */
#ifdef __RTX
  ((USBD_RTX_DevTask   != 0) ? (1 <<  3) : 0);   /* SOF int unmask            */
#else                            
  ((USBD_P_SOF_Event   != 0) ? (1 <<  3) : 0);   /* SOF int unmask            */
#endif

  USBD_IntrEna();                       /* Enable OTG interrupt               */
  OTG->GAHBCFG    |=  1 | (1 << 7);     /* Enable interrupts                  */
}


/*
 *  USB Device Connect Function
 *   Called by the User to Connect/Disconnect USB Device
 *    Parameters:      con:   Connect/Disconnect
 *    Return Value:    None
 */

void USBD_Connect (uint32_t con) {
  if (con) {
    OTG->GCCFG  |=  (1 << 19) |         /* enable VBUS sensing device "B"     */
                    (1 << 16);          /* power down deactivated             */
    OTG->DCTL   &= ~(1 <<  1);          /* soft disconnect disabled           */
  }
  else {
    OTG->DCTL   |=  (1 <<  1);          /* soft disconnect enabled            */
    OTG->GCCFG  &= ~(1 << 19) |         /* disable VBUS sensing device "B"    */
                    (1 << 16);          /* power down activated               */
  }
}


/*
 *  USB Device Reset Function
 *   Called automatically on USB Device Reset
 *    Return Value:    None
 */

void USBD_Reset (void) {
  uint32_t i;

  SyncWriteEP       = 0;
  InPacketDataReady = 0;
  OTG->DOEPMSK      = 0;
  OTG->DIEPMSK      = 0;  
  
  for (i = 0; i < (USBD_EP_NUM + 1); i++) {
    if (DOEPCTL(i) & (1UL << 31))
      DOEPCTL(i)  = (1 << 30) | (1 << 27);   /* OUT EP disable, Set NAK       */
    if (DIEPCTL(i) & (1UL << 31))
      DIEPCTL(i)  = (1 << 30) | (1 << 27);   /* IN EP disable, Set NAK        */
    
    DIEPINT(i)    = 0x1B;                    /* clear IN Ep interrupts        */
    DOEPINT(i)    = 0x1B;                    /* clear OUT Ep interrupts       */
  }

  USBD_SetAddress(0 , 1);

  OTG->DAINTMSK  = (1 << 16) |          /* unmask IN&OUT EP0 interruts        */
                    1;
  OTG->DOEPMSK   = (1 << 3) |           /* setup phase done                   */
                   (1 << 1) |           /* endpoint disabled                  */
                    1;                  /* transfer complete                  */
  OTG->DIEPMSK   = (1 << 1) |           /* endpoint disabled                  */
                    1;                  /* transfer completed                 */

  OTG->GRXFSIZ   =  RX_FIFO_SIZE / 4;
  OTG->DIEPTXF0  = (RX_FIFO_SIZE/4) | ((TX0_FIFO_SIZE/4) << 16);

  OTG->DIEPTXF1  = ((RX_FIFO_SIZE + TX0_FIFO_SIZE)/4) |
                   ((TX1_FIFO_SIZE/4) << 16);

  OTG->DIEPTXF2  = ((RX_FIFO_SIZE + TX0_FIFO_SIZE + TX1_FIFO_SIZE)/4) |
                   ((TX2_FIFO_SIZE/4) << 16);

  OTG->DIEPTXF3  = ((RX_FIFO_SIZE + TX0_FIFO_SIZE+ TX1_FIFO_SIZE +TX2_FIFO_SIZE)/4) |
                   ((TX3_FIFO_SIZE/4) << 16);

  OTG->DOEPTSIZ0 =  (1 << 29) |         /* setup count = 1                    */
                    (1 << 19) |         /* packet count                       */
                     USBD_MAX_PACKET0;
}


/*
 *  USB Device Suspend Function
 *   Called automatically on USB Device Suspend
 *    Return Value:    None
 */

void USBD_Suspend (void) {
}


/*
 *  USB Device Resume Function
 *   Called automatically on USB Device Resume
 *    Return Value:    None
 */

void USBD_Resume (void) {
}


/*
 *  USB Device Remote Wakeup Function
 *   Called automatically on USB Device Remote Wakeup
 *    Return Value:    None
 */

void USBD_WakeUp (void) {
  OTG->DCTL |= 1;                       /* remote wakeup signaling            */
  usbd_stm32_delay (50);                /* Wait ~5 ms                         */
  OTG->DCTL &= ~1;
}


/*
 *  USB Device Remote Wakeup Configuration Function
 *    Parameters:      cfg:   Device Enable/Disable
 *    Return Value:    None
 */

void USBD_WakeUpCfg (uint32_t cfg) {
  /* Not needed                                                               */
}


/*
 *  USB Device Set Address Function
 *    Parameters:      adr:   USB Device Address
 *    Return Value:    None
 */

void USBD_SetAddress (uint32_t  adr, uint32_t setup) {
  if (setup) {
    OTG->DCFG = (OTG->DCFG & ~(0x7f << 4)) | (adr << 4);
  }
}

