ARMmbed/DAPLink/source/hic_hal/stm32/drivers/usbd_STM32F4xx_FS.c
/*
 *  USB Device Flush IN Endpoint Transmit Fifo
 *    Parameters:      adr:   USB Device Address
 *    Return Value:    None
 */
static void USBD_FlushInEpFifo (uint32_t EPNum) {
  uint32_t wcnt;
  
  EPNum &= ~0x80;
  OTG->GRSTCTL = (OTG->GRSTCTL & ~(0x1F << 6)) | /* flush EP fifo             */
                 (EPNum << 6)| (1 << 5);
  wcnt = 10;
  while (OTG->GRSTCTL & (1 << 5))       /* wait until fifo is flushed         */
    if ((wcnt--) == 0) break;
}


/*
 *  USB Device Configure Function
 *    Parameters:      cfg:   Device Configure/Deconfigure
 *    Return Value:    None
 */

void USBD_Configure (uint32_t cfg) {
  InPacketDataReady &= ~1UL;
}


/*
 *  Configure USB Device Endpoint according to Descriptor
 *    Parameters:      pEPD:  Pointer to Device Endpoint Descriptor
 *    Return Value:    None
 */

void USBD_ConfigEP (USB_ENDPOINT_DESCRIPTOR *pEPD) {
  uint32_t num, val, type;

  num  = pEPD->bEndpointAddress & ~(0x80);
  val  = pEPD->wMaxPacketSize;
  type = pEPD->bmAttributes & USB_ENDPOINT_TYPE_MASK;

  if (pEPD->bEndpointAddress & USB_ENDPOINT_DIRECTION_MASK) {
    OTG->DAINTMSK |= (1    << num);     /* unmask IN EP int                   */
    DIEPCTL(num)   = (num  <<  22) |    /* fifo number                        */
                     (type <<  18) |    /* ep type                            */
                      val & 0x7FF;      /* max packet size                    */
    if ((type & 3) > 1)                 /* if interrupt or bulk EP            */
      DIEPCTL(num) |= (1 << 28);        /* DATA0 PID                          */
  } else {
    OutMaxPacketSize[num] = val & 0x7FF;

    OTG->DAINTMSK |= (1 << (num + 16)); /* unmask OUT EP int                  */

    DOEPCTL(num)   = (type <<  18)|     /* EP type                            */
                     (val & 0x7FF);     /* max packet size                    */
    DOEPTSIZ(num)  = (1 << 19)    |     /* packet count = 1                   */
                     (val  & 0x7FF);    /* transfer size                      */
    if ((type & 3) > 1)                 /* if int or bulk EP                  */
      DOEPCTL(num) |= (1 << 28);        /* DATA0 PID                          */
  }
}


/*
 *  Set Direction for USB Device Control Endpoint
 *    Parameters:      dir:   Out (dir == 0), In (dir <> 0)
 *    Return Value:    None
 */

void USBD_DirCtrlEP (uint32_t dir) {
  /* Not needed                                                               */
}


/*
 *  Enable USB Device Endpoint
 *    Parameters:      EPNum: Device Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    None
 */

void USBD_EnableEP (uint32_t EPNum) {
  if (EPNum & 0x80) {
    EPNum &= ~0x80;
    DIEPCTL(EPNum)    |= (1   << 15) |  /* EP active                          */
                         (1   << 27);   /* set EP NAK                         */
    if (DIEPCTL(EPNum)&  (1UL << 31))
      DIEPCTL(EPNum)  |= (1   << 30);   /* disable EP                         */

    InPacketDataReady &= ~(1 << EPNum);
    if (EP_IN_TYPE(EPNum) == USB_ENDPOINT_TYPE_ISOCHRONOUS) {
      OTG->GINTMSK |= (1 << 20);        /* enable IISOIXFR                    */
    }
  } else {
    if (EP_OUT_TYPE(EPNum) == USB_ENDPOINT_TYPE_ISOCHRONOUS) {
      OTG->GINTMSK   |= (1 << 15);      /* enable end of periodic frame       */
      DOEPCTL(EPNum) |= (1 << 15);      /* EP active                          */
    } else {
      DOEPCTL(EPNum)  |= (1   << 15) |  /* EP active                          */
                         (1UL << 31) |  /* enable EP                          */
                         (1   << 26);   /* clear EP NAK                       */
    }
  }
}


/*
 *  Disable USB Endpoint
 *    Parameters:      EPNum: Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    None
 */

void USBD_DisableEP (uint32_t EPNum) {
  uint32_t num, wcnt, IsoEpEnCnt;

  IsoEpEnCnt = 0;

  /* Disable IN Endpoint                                                      */
  if (EPNum & 0x80) {
    EPNum &= ~0x80;
    for (num = 1; num <= USBD_EP_NUM; num++) {
      if (DIEPCTL(num) & (1 <<15)) {
        if (EP_IN_TYPE(num) == USB_ENDPOINT_TYPE_ISOCHRONOUS) {
          IsoEpEnCnt++;
        }
      }
    }

    InPacketDataReady &= ~(1 << EPNum);
    if (IsoEpEnCnt == 1) {              /* if all iso endpoints disabled      */
      OTG->GINTMSK &= ~(1 << 20);       /* disable IISOIXFR                   */
    }
    if (DIEPCTL(EPNum) &   (1UL << 31))
      DIEPCTL(EPNum)   |=  (1   << 30); /* disable EP                         */
    DIEPCTL(EPNum)     |=  (1   << 27); /* set EP NAK                         */
    DIEPCTL(EPNum)     &= ~(1   << 15); /* deactivate EP                      */
    
  /* Disable OUT Endpoint                                                     */
  } else {
    for (num = 1; num <= USBD_EP_NUM; num++) {
      if (DOEPCTL(num) & (1 <<15)) {
        if (EP_OUT_TYPE(num) == USB_ENDPOINT_TYPE_ISOCHRONOUS) {
          IsoEpEnCnt++;
        }
      }
    }
    if (IsoEpEnCnt == 1)                /* if all iso endpoints disabled      */
      OTG->GINTMSK &= ~(1 << 15);       /* disable EOPF                       */
    
    OTG->DCTL |= (1 << 9);              /* set global out nak                 */

    wcnt = 1000;
    while (!(OTG->GINTSTS & (1 << 7)))  /* wait until global NAK              */
      if ((wcnt--) == 0) break;
    
    if (DOEPCTL(EPNum) &   (1UL << 31))   /* if ep enabled                    */
      DOEPCTL(EPNum)   |=  (1   << 30);   /* disable EP                       */
    DOEPCTL(EPNum)     |=  (1   << 27);   /* set EP NAK                       */
    DOEPCTL(EPNum)     &= ~(1   << 15);   /* deactivate EP                    */

    wcnt = 1000;
    while(!(DOEPINT(EPNum) & (1 << 1)))   /* wait until EP disabled           */
      if ((wcnt--) == 0) break;
    OTG->DCTL |= (1 << 10);               /* clear global nak                 */
  }
}


