ARMmbed/DAPLink/source/hic_hal/stm32/drivers/usbd_STM32F4xx_FS.c
/*
 *  Reset USB Device Endpoint
 *    Parameters:      EPNum: Device Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    None
 */

void USBD_ResetEP (uint32_t EPNum) {

  /* Reset IN Endpoint                                                        */
  if (EPNum & 0x80) {
    EPNum &= ~0x80;
    InPacketDataReady &= ~(1 << EPNum);
    if (DIEPCTL(EPNum) &  (1UL << 31))  /* if Endpoint enabled                */
      DIEPCTL(EPNum)   |= (1   << 30);  /* disable EP                         */
    DIEPCTL(EPNum)     |= (1   << 27);  /* set EP NAK                         */

    USBD_FlushInEpFifo (EPNum | 0x80);  /* Flush endpoint fifo                */

    /* If endpoint is isochronous, set proper EVEN/ODD frame and enable Ep    */
    if (EP_IN_TYPE(EPNum) == USB_ENDPOINT_TYPE_ISOCHRONOUS) {
      if (USBD_GetFrame() & 1) DIEPCTL(EPNum) |= (1 << 28); /* set even frame */
      else DIEPCTL(EPNum) |= (1 << 29);                     /* set odd frame  */
      DIEPCTL(EPNum)  |= (1UL << 31) | (1 << 26);           /* enable EP      */
    }
  }
}


/*
 *  Set Stall for USB Device Endpoint
 *    Parameters:      EPNum: Device Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    None
 */

void USBD_SetStallEP (uint32_t EPNum) {
  uint32_t wcnt;
  
  /* Stall OUT Endpoint                                                       */
  if (!(EPNum & 0x80)) {
    OTG->DCTL |= (1 << 9);              /* set global out nak                 */
    wcnt = 1000;
    while (!(OTG->GINTSTS & (1 << 7)))    /* wait until global NAK            */
      if ((wcnt--) == 0) break;
    
    if (DOEPCTL(EPNum) &   (1UL << 31)) /* if endpoint enabled                */
      DOEPCTL(EPNum)   |=  (1   << 30); /* disable EP                         */
    DOEPCTL(EPNum) |= (1 << 21);        /* set stall                          */
    
    wcnt = 1000;
    while(!(DOEPINT(EPNum) & (1 << 1))) /* wait until EP disabled             */
      if ((wcnt--) == 0) break;
      
    OTG->DCTL |= (1 << 10);             /* clear global nak                   */

  /* Stall IN endpoint                                                        */
  } else {
    EPNum &= ~0x80;
    if (DIEPCTL(EPNum) &  (1UL << 31))  /* if endpoint enabled                */
      DIEPCTL(EPNum)   |= (1   << 30);  /* disable endpoint                   */
    DIEPCTL(EPNum)     |= (1   << 21);  /* set stall                          */

    USBD_FlushInEpFifo (EPNum | 0x80);  /* Flush endpoint fifo                */
  }
}


/*
 *  Clear Stall for USB Device Endpoint
 *    Parameters:      EPNum: Device Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    None
 */

void USBD_ClrStallEP (uint32_t EPNum) {
  /* Clear OUT endpoint Stall                                                 */
  if (!(EPNum & 0x80)) {

    if (((DOEPCTL(EPNum) >> 18) & 3) > 1) { /* if EP type Bulk or Interrupt   */
      DOEPCTL(EPNum) |= (1 << 28);      /* Set DATA0 PID                      */

    DOEPCTL(EPNum) &= ~(1 << 21);       /* Clear stall                        */
  }
 
  /* Clear IN Endpoint Stall                                                  */
  } else {
    EPNum &= ~0x80;

    if (DIEPCTL(EPNum) &  (1UL << 31))  /* if endpoint enabled                */
      DIEPCTL(EPNum)   |= (1 << 30);    /* disable endpoint                   */

    USBD_FlushInEpFifo (EPNum | 0x80);  /* Flush endpoint fifo                */

    if (((DIEPCTL(EPNum) >> 18) & 3) > 1)/* if Interrupt or bulk EP           */
      DIEPCTL(EPNum) |= (1 << 28);      /* Set DATA0 PID                      */

    DIEPCTL(EPNum) &= ~(1 << 21);       /* clear Stall                        */
  }
}


/*
 *  Clear USB Device Endpoint Buffer
 *    Parameters:      EPNum: Device Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    None
 */

void USBD_ClearEPBuf (uint32_t EPNum) {
  if (EPNum & 0x80) {
    USBD_FlushInEpFifo (EPNum | 0x80);
  } else {
    OTG->GRSTCTL |= (1 << 4);
    __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP();
    __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP();
  }
}


/*
 *  Read USB Device Endpoint Data
 *    Parameters:      EPNum: Device Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *                     pData: Pointer to Data Buffer
 *    Return Value:    Number of bytes read
 */

uint32_t USBD_ReadEP (uint32_t EPNum, uint8_t *pData) {
  uint32_t i, sz, isoEpFlag;

  if ((DOEPCTL(EPNum) & (1 << 15)) == 0) return (0); /* if Ep not active      */
  isoEpFlag = (EP_OUT_TYPE(EPNum) == USB_ENDPOINT_TYPE_ISOCHRONOUS);
  
  /* Isochronous Ep: read data from intermediate buffer                       */
  if (isoEpFlag) {                      /* if Isochronouos endpoint           */
    if (IsoOutTokenRead == 0) {          
      sz = IsoOutPacketDataCnt[EPNum];  /* get data size                      */
      for (i = 0; i < sz; i++) {        /* copy data from intermediate buffer */
        pData[i] = ((uint8_t *)(IsoOutPacketDataPtr[EPNum]))[i];
      }
      IsoOutPacketDataCnt[EPNum] = 0;   /* reset data count                   */
      return (sz);
    }
  }
  
  sz = ( OTG->GRXSTSP >> 4) & 0x7FF;    /* get available data size            */
   if (isoEpFlag) {
    /* if data pid = data0 and 
       number of packets in which this payload was received = 1, data is valid*/
    if ((DOEPTSIZ(EPNum) & ((0x3FF << 19) | (3 << 29))) == 0)  
      IsoOutPacketDataCnt[EPNum] = sz;  /* save isochronous Ep data size      */
    else IsoOutPacketDataCnt[EPNum] = 0;/* else data is unvalid               */ 
  }

  /* copy data from fifo
     if Isochronous Ep: data is copied to intermediate buffer                 */
  for (i = 0; i < (uint32_t)((sz+3)/4); i++) {
    *((__packed uint32_t *)pData) = RX_FIFO;
    pData += 4;
  }
  /* wait RxFIFO non-empty (OUT transfer completed or Setup trans. completed) */
  while ((OTG->GINTSTS & (1 << 4)) == 0);  
  OTG->GRXSTSP;                         /* pop register                       */
  OTG->GINTMSK |= (1 << 4);             /* unmask RxFIFO non-empty interrupt  */

  return (sz);
}


